Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Where required elsewhere in the code, doors in smoke partitions shall be self- or automatic-closing by smoke detection in accordance with Section 716.2.6.6.
fr_ca: Lorsque le présent code l’exige ailleurs, les portes des cloisons pare-fumée doivent être à fermeture automatique ou se fermer automatiquement sous l’effet de la détection de fumée, conformément à la section 716.2.6.6.

source: Where required elsewhere in the code, doors in smoke partitions shall meet the requirements for a smoke and draft control door assembly tested in accordance with UL 1784.
fr_ca: Lorsque le présent code l’exige ailleurs, les portes des cloisons pare-fumée doivent satisfaire aux exigences applicables à un assemblage de porte de contrôle de la fumée et des courants d’air soumis à des essais conformément à la norme UL 1784.

source: Where required to exhibit improved fire performance, curtains, draperies, fabric hangings and similar combustible decorative materials suspended from walls or ceilings shall be tested by an approved agency and meet the flame propagation performance criteria of Test 1 or 2, as appropriate, of NFPA 701, or exhibit a maximum heat release rate of 100 kW when tested in accordance with NFPA 289, using the 20 kW ignition source.
fr_ca: Lorsque des rideaux, tentures, éléments suspendus en tissu et matériaux décoratifs combustibles similaires suspendus aux murs ou aux plafonds doivent présenter une performance au feu améliorée, ils doivent être soumis à des essais par une agence approuvée et satisfaire aux critères de performance en matière de propagation des flammes de l’essai 1 ou 2, selon le cas, de la norme NFPA 701, ou présenter un taux maximal de dégagement de chaleur de 100 kW lorsqu’ils sont soumis à des essais conformément à la norme NFPA 289, au moyen de la source d’allumage de 20 kW.

source: Where restricted entrances are provided to a building or facility, at least one restricted entrance to the building or facility shall be accessible.
fr_ca: Lorsque des entrées restreintes sont prévues pour un bâtiment ou un établissement, au moins une entrée restreinte du bâtiment ou de l'établissement doit être accessible.

source: Where rooms and spaces without openings to the outdoors are ventilated through an adjoining room, the opening to the adjoining room shall be unobstructed and shall have an area of not less than 8 percent of the floor area of the interior room or space, but not less than 25 square feet (2.3 m2).
fr_ca: Lorsque des pièces et espaces sans ouverture sur l’extérieur sont ventilés par l’intermédiaire d’une pièce adjacente, l’ouverture donnant sur la pièce adjacente doit être libre de toute obstruction et avoir une superficie d’au moins 8 % de la superficie de plancher de la pièce ou de l’espace intérieur, sans toutefois être inférieure à 25 pi2 (2,3 m2).

source: Where seating encircles the stage or field, in whole or in part, horizontal dispersion shall include the entire seating area.
fr_ca: Lorsque les SIÈGES entourent la scène ou le terrain, en tout ou en partie, la dispersion horizontale doit inclure toute la zone des SIÈGES.

source: Where seating is located at a table or counter and is adjacent to an aisle or aisle accessway, the measurement of required clear width of the aisle or aisle accessway shall be made to a line 19 inches (483 mm) away from and parallel to the edge of the table or counter.
fr_ca: Lorsque des sièges sont situés à une table ou à un comptoir et sont adjacents à une allée ou à une voie d’accès à l’allée, la largeur libre requise de l’allée ou de la voie d’accès à l’allée doit être mesurée jusqu’à une ligne située à 19 po (483 mm) du bord de la table ou du comptoir et parallèle à celui-ci.

source: Where seating is provided in saunas and steam rooms, at least one bench shall comply with Section 903.
fr_ca: Lorsque des sièges sont prévus dans les saunas et les hammams, au moins un banc doit être conforme à la section 903.

source: Where seating provides lines of sight over heads, spectators in wheelchair space locations shall be afforded lines of sight complying with Section 802.9.1.1.
fr_ca: Lorsque les SIÈGES offrent des lignes de vue au-dessus des têtes de mur, les spectateurs dans les emplacements pour fauteuils roulants doivent bénéficier de lignes de vue conformes à la section 802.9.1.1.

source: Where seating rows have 14 or fewer seats, the minimum clear aisle accessway width shall be not less than 12 inches (305 mm) measured as the clear horizontal distance from the back of the row ahead and the nearest projection of the row behind.
fr_ca: Lorsque les rangées de sièges comportent au plus 14 sièges, la largeur libre minimale de la voie d’accès à une allée doit être d’au moins 12 po (305 mm), mesurée comme la distance horizontale libre entre l’arrière de la rangée située devant et la saillie la plus proche de la rangée située derrière.

source: Where security barriers incorporate elements that cannot comply with these requirements, such as certain metal detectors, fluoroscopes or other similar devices, the accessible route shall be permitted to be provided adjacent to security screening devices.
fr_ca: Lorsque des barrières de sécurité comportent des éléments qui ne peuvent pas être conformes à ces exigences, comme certains détecteurs de métaux, fluoroscopes ou autres dispositifs similaires, il est permis d’aménager la voie accessible à côté des dispositifs de contrôle de sécurité.

source: Where separate raised and visual characters with the same information are provided, the height of the raised uppercase letter “I” shall be permitted to be 1/2 inch (13 mm) minimum.
fr_ca: Lorsque des caractères en relief et visuels distincts contenant les mêmes informations sont fournis, la hauteur de la lettre majuscule « I » en relief peut être d'au moins 1/2 po [13 mm].

source: Where separate raised characters and visual characters with the same information are provided, raised characters are not required to have nonglare finish or to contrast with their background.
fr_ca: Lorsque des caractères en relief et des caractères visuels distincts contenant les mêmes informations sont fournis, les caractères en relief ne sont pas tenus d'avoir une finition antireflet ni de contraster avec leur arrière-plan.

source: Where side rails are provided at the changing surface they shall comply with Sections 613.4.5.1 and 613.4.5.2.
fr_ca: Lorsque des barrières latérales sont prévues au niveau de la surface à langer, elles doivent être conformes aux sections 613.4.5.1 et 613.4.5.2.

source: Where signs with both visual and raised characters are required, either one sign with both visual and raised characters, or two separate signs, one with visual, and one with raised characters, shall be provided.
fr_ca: Lorsque des panneaux comportant à la fois des caractères visuels et des caractères en relief sont exigés, il faut prévoir soit un panneau comportant à la fois des caractères visuels et des caractères en relief, soit deux panneaux distincts, l'un comportant des caractères visuels et l'autre, des caractères en relief.

source: Where special conditions exist, the building official is authorized to require additional construction documents to be prepared by a registered design professional.
fr_ca: Lorsque des conditions particulières existent, le responsable de la construction est autorisé à exiger que des documents de construction supplémentaires soient préparés par un professionnel de la conception enregistré.

source: Where specifically permitted by Section 1108.5 or 1108.6, the required number of Type A units and Type B units is permitted to be reduced in accordance with Sections 1108.7.1 through 1108.7.5.
fr_ca: Lorsqu’il est expressément permis par la section 1108.5 ou 1108.6, le nombre requis de logements de type A et de type B peut être réduit conformément aux sections 1108.7.1 à 1108.7.5.

source: Where spectators are expected to remain seated during events, spectators seated in a wheelchair space shall be provided with lines of sight to the performance area or playing field comparable to that provided to seated spectators in closest proximity to the wheelchair space location.
fr_ca: Lorsque les spectateurs sont censés rester assis pendant les événements, les spectateurs assis dans un espace pour fauteuil roulant doivent disposer de lignes de visibilité vers la zone de spectacle ou le terrain de jeu comparables à celles dont disposent les spectateurs assis les plus proches de l'emplacement de l'espace pour fauteuil roulant.

source: Where spectators are expected to remain seated for purposes of viewing events, spectators in wheelchair space locations shall be provided with a line of sight in accordance with Section 802.9.1.
fr_ca: Lorsque les spectateurs sont censés rester assis pour regarder les événements, les spectateurs situés dans les emplacements pour fauteuils roulants doivent disposer d'une ligne de visibilité selon la section 802.9.1.

source: Where spectators in front of the wheelchair space locations will be expected to stand at their seats for purposes of viewing events, spectators in wheelchair space locations shall be provided with a line of sight in accordance with Section 802.9.2.
fr_ca: Lorsque les spectateurs devant les emplacements d'espace pour fauteuil roulant devront se tenir debout à leur place pour regarder les événements, les spectateurs dans les emplacements d'espace pour fauteuil roulant doivent disposer d'une ligne de vue selon la section 802.9.2.

source: Where stepped aisles have seating on one side and the aisle width is 74 inches (1880 mm) or greater, two handrails are required.
fr_ca: Lorsque les allées à gradins comportent des sièges sur un côté et que la largeur de l’allée est de 74 po (1 880 mm) ou plus, deux mains courantes sont exigées.

source: Where storage facilities are provided, at least one of each type shall comply with Section 905.
fr_ca: Lorsque des installations d'entreposage sont prévues, au moins une de chaque type doit se conformer à la section 905.

source: Where stories have entrances not included in determining compliance with Section 1108.7.1.1, and such entrances are proximate to arrival points intended to serve units on that story, as indicated in Items 1 and 2, all dwelling units and sleeping units intended to be occupied as a residence served by that entrance on that story shall be Type B units.
fr_ca: Lorsque des étages comportent des entrées qui ne sont pas prises en compte pour déterminer la conformité à la section 1108.7.1.1 et que ces entrées sont situées à proximité des points d’arrivée destinés à desservir les unités situées à cet étage, comme indiqué aux points 1 et 2, tous les logements et unités de couchage destinés à être occupés comme résidence desservis par cette entrée à cet étage doivent être des unités de type B.

source: Where such arrival points are not within 50 feet (15 240 mm) of the primary entrances, the closest arrival points shall be used.
fr_ca: Lorsque ces points d'arrivée ne se trouvent pas à moins de 50 pi (15 240 mm) des entrées principales, les points d'arrivée les plus proches doivent être utilisés.

source: Where tables or counters are served by fixed seats, the width of the aisle or aisle accessway shall be measured from the back of the seat.
fr_ca: Lorsque des tables ou des comptoirs sont desservis par des sièges fixes, la largeur de l'allée ou de la voie d'accès à l'allée doit être mesurée à partir du dossier du siège.

source: Where the adult changing station is not required by the administrative authority, a fixed height changing surface shall be permitted and shall be mounted with the top of the changing surface 19 inches (483mm) minimum and 23 inches (584 mm) maximum above the floor.
fr_ca: Lorsque la table à langer pour adultes n'est pas exigée par l'autorité administrative, une surface à langer à hauteur fixe est autorisée et doit être installée de manière à ce que le haut de la surface à langer se situe à une hauteur comprise entre 19 po [483 mm] et 23 po [584 mm] au-dessus du sol.

source: Where the air infiltration rate of a dwelling unit is 5 air changes per hour or less where tested with a blower door at a pressure of 0.2 inch w.c (50 Pa) in accordance with Section N1102.4.1.2, the dwelling unit shall be provided with whole-house mechanical ventilation in accordance with Section M1505.4.
fr_ca: Lorsque le taux d’infiltration d’air d’un logement est d’au plus 5 renouvellements d’air à l’heure lorsqu’il est soumis à un essai à l’aide d’une porte soufflante à une pression de 0,2 po de colonne d’eau (50 Pa), conformément à la section N1102.4.1.2, le logement doit être pourvu d’un système de ventilation mécanique de l’ensemble du bâtiment conforme à la section M1505.4.

source: Where the backs of seats on the front of the cross aisle project 24 inches (610 mm) or more above the adjacent floor of the aisle, a guard need not be provided.
fr_ca: Lorsque les dossiers des sièges situés à l’avant de l’allée transversale dépassent de 24 po (610 mm) ou plus au-dessus du plancher adjacent de l’allée, un garde-corps n’est pas exigé.

source: Where the bedrooms are grouped in sleeping units, only one bedroom in each sleeping unit shall count toward the number of required Type A units.
fr_ca: Lorsque les chambres sont regroupées en unités de couchage, une seule chambre dans chaque unité de couchage doit compter dans le nombre d'unités de type A exigées.

source: Where the bedrooms are grouped into dwelling or sleeping units, only one bedroom in each dwelling or sleeping unit shall be permitted to count toward the number of required Accessible units.
fr_ca: Lorsque les chambres à coucher sont regroupées en logements ou en unités de couchage, une seule chambre à coucher de chaque logement ou unité de couchage peut être comptée dans le nombre d’unités accessibles requises.

source: Where the bottom of the firebox opening is raised not less than 8 inches (203 mm) above the top of the hearth extension, a hearth extension of not less than 3/8-inch-thick (10 mm) brick, concrete, stone, tile or other approved noncombustible material is permitted.
fr_ca: Lorsque le bas de l'ouverture de la chambre de combustion est surélevé d'au moins 8 po [203 mm] au-dessus du dessus de l'extension de foyer, une extension de foyer en brique, en béton, en pierre, en carreaux ou en tout autre matériau non combustible approuvé d'au moins 3/8 po [10 mm] d'épaisseur est autorisée.

source: Where the building is classified as a Group A occupancy, the main exit shall front on not less than one street or an unoccupied space of not less than 10 feet (3048 mm) in width that adjoins a street or public way.
fr_ca: Lorsque le bâtiment est classé dans le groupe A, l’issue principale doit donner sur au moins une rue ou sur un espace inoccupé d’au moins 10 pi (3 048 mm) de largeur qui est adjacent à une rue ou à une voie publique.

source: Where the building is protected throughout with an automatic sprinkler system installed in accordance with Section 903.3.1.1 or 903.3.1.2, the required fire-resistance rating shall be reduced to 1 hour.
fr_ca: Lorsque le bâtiment est entièrement protégé par un système d'extincteurs automatiques installé conformément à l’article 903.3.1.1 ou 903.3.1.2, le degré de résistance au feu requis doit être réduit à 1 heure.

source: Where the building is protected throughout with an automatic sprinkler system installed in accordance with Section 903.3.1.1, the required rating shall be reduced to 1 hour.
fr_ca: Lorsque le bâtiment est entièrement protégé par un système d'extincteurs automatiques installé conformément à l’article 903.3.1.1, le degré de résistance au feu requis doit être réduit à 1 heure.

source: Where the building official finds any work regulated by this code being performed in a manner contrary to the provisions of this code or in a dangerous or unsafe manner, the building official is authorized to issue a stop work order.
fr_ca: Lorsque le responsable de la construction constate que des travaux réglementés par le présent code sont exécutés d'une manière contraire aux dispositions du présent code ou d'une manière dangereuse ou non sécuritaire, le responsable de la construction est autorisé à émettre un ordre d'arrêt des travaux.

source: Where the ceiling of the atrium is more than 55 feet (16 764 mm) above the floor, sprinkler protection at the ceiling of the atrium is not required.
fr_ca: Lorsque le plafond de l’atrium se trouve à plus de 55 pi (16 764 mm) au-dessus du plancher, une protection par gicleurs au plafond de l’atrium n’est pas exigée.

source: Where the circulation path is interior, the accessible route shall be interior.
fr_ca: Lorsque la voie de circulation est intérieure, l'itinéraire accessible doit être intérieur.

source: Where the clear floor space is positioned for a forward approach, knee and toe clearance complying with Section 306 shall be provided.
fr_ca: Lorsque la surface de plancher dégagée est positionnée pour une approche de face, un espace pour les genoux et un espace pour les orteils doit être prévu conformément à la section 306.

source: Where the clear floor space is positioned for a forward approach, the centerline of the clear floor space shall be offset 15 inches (380 mm) maximum from the centerline of the appliance.
fr_ca: Lorsque l’espace libre au sol est positionné de manière à permettre une approche de face, l’axe central de l’espace libre au sol doit être décalé d’au plus 15 pouces (380 mm) par rapport à l’axe central de l’appareil.

source: Where the clear floor space is positioned for a parallel approach, the centerline of the clear floor space shall be offset 24 inches (610 mm) maximum from the centerline of the appliance.
fr_ca: Lorsque l’espace libre au sol est positionné de manière à permettre une approche parallèle, l’axe central de l’espace libre au sol doit être décalé de 24 pouces (610 mm) au maximum par rapport à l’axe central de l’appareil.

source: Where the clear floor space is positioned for a parallel approach, the clear floor space shall be centered on the appliance.
fr_ca: Lorsque la surface de plancher dégagée est positionnée pour un accès parallèle, la surface de plancher dégagée doit être centrée sur l'appareil.

source: Where the combined total water closet compartments and urinals provided in a toilet room or bathing room is six or more, at least 5 percent of the total number of compartments shall be ambulatory accessible, provided in addition to the wheelchair accessible compartment.
fr_ca: Lorsque le nombre total combiné des compartiments de toilettes et des urinoirs fournis dans une salle de toilettes ou une salle de bain est de six ou plus, au moins 5 pour cent du nombre total de compartiments doivent être accessibles sans fauteuil, en plus des compartiments accessibles aux chaises roulantes.

source: Where the door molding does not provide sufficient flat surface on which to locate the stripe, the stripe shall be permitted to be located on the wall surrounding the frame.
fr_ca: Lorsque la moulure de la porte n'offre pas une surface plane suffisante pour y placer la bande, celle-ci peut être placée sur le mur entourant le cadre.

source: Where the equipment and ductwork is located within the exit passageway, the intake air shall be taken directly from the outdoors and the exhaust air shall be discharged directly to the outdoors, or the air shall be conveyed through ducts enclosed in construction as required for shafts.
fr_ca: Lorsque les équipements et les conduits sont situés à l’intérieur du passage d’issue, l’air d’admission doit être prélevé directement de l’extérieur et l’air d’évacuation doit être rejeté directement à l’extérieur, ou l’air doit être acheminé par des conduits enfermés dans une construction conforme aux exigences applicables aux puits.

source: Where the fireplace opening is 6 square feet (0.6 m2) or larger, the hearth extension shall extend not less than 20 inches (508 mm) in front of and not less than 12 inches (305 mm) beyond each side of the fireplace opening.
fr_ca: Lorsque l'ouverture du foyer est de 6 pi2 [0,6 m2] ou plus, le prolongement de foyer doit s'étendre sur au moins 20 po [508 mm] devant l'ouverture du foyer et sur au moins 12 po [305 mm] au-delà de chaque côté de l'ouverture du foyer.

source: Where the glazing is protected by a guard complying with Section R312 and the plane of the glass is more than 18 inches (457 mm) from the guard.
fr_ca: Lorsque le vitrage est protégé par un garde-corps conforme à la section R312 et que le plan du verre est à plus de 18 po [457 mm] du garde-corps.

source: Where the gradient of stepped aisles is to be the same as the gradient of adjoining seating areas, the riser height shall be not less than 4 inches (102 mm) nor more than 8 inches (203 mm) and shall be uniform within each flight.
fr_ca: Lorsque la pente des allées à gradins est la même que celle des aires de sièges adjacentes, la hauteur des contremarches ne doit être ni inférieure à 4 po (102 mm) ni supérieure à 8 po (203 mm), et doit être uniforme dans chaque volée.

source: Where the horizontal assembly is required to be a smoke barrier, the assembly shall comply with Section 709.
fr_ca: Lorsque l’ensemble horizontal doit constituer une séparation pare-fumée, il doit être conforme à la section 709.

source: Where the horizontal assembly separates a single occupancy into different fire areas, the assembly shall have a fire-resistance rating of not less than that required by Section 707.3.10.
fr_ca: Lorsque l’ensemble horizontal sépare un même usage en différentes aires d’incendie, l’assemblage doit présenter une résistance au feu d’au moins celle exigée par la section 707.3.10.

source: Where the horizontal assembly separates incidental uses from the remainder of the building, the assembly shall have a fire-resistance rating of not less than that required by Section 509.
fr_ca: Lorsque l’ensemble horizontal sépare des usages accessoires du reste du bâtiment, il doit présenter une résistance au feu d’au moins celle exigée par la section 509.

source: Where the horizontal assembly separates mixed occupancies, the assembly shall have a fire-resistance rating of not less than that required by Section 508.4 based on the occupancies being separated.
fr_ca: Lorsque l’ensemble horizontal sépare des usages mixtes, l’assemblage doit présenter une résistance au feu d’au moins celle exigée par la section 508.4, selon les usages séparés.

source: Where the inside surface of the smoke chamber is formed by corbeled masonry, the walls shall not be corbeled more than 30 degrees (0.52 rad) from vertical.
fr_ca: Lorsque la surface intérieure de la chambre de fumée est formée de maçonnerie à encorbellements, les murs ne doivent pas être encorbelés à plus de 30 degrés (0,52 rad) de la verticale.

source: Where the installation of a smoke damper will interfere with the operation of a required smoke control system in accordance with Section 909, approved alternative protection shall be utilized.
fr_ca: Lorsque l’installation d’un registre coupe-fumée nuit au fonctionnement d’un système de contrôle des fumées requis conformément à la section 909, une protection de remplacement approuvée doit être utilisée.

source: Where the lavatory overlaps the water closet clearance in accordance with the exception to Section 1103.11.2.4.4 reinforcement at the water closet rear wall for a 24-inch (610 mm) minimum length grab bar, centered on the water closet, shall be provided.
fr_ca: Lorsque le lavabo empiète sur l'espace libre de la cabine de toilette conformément à l'exception de la section 1103.11.2.4.4, il faut prévoir un renforcement au mur arrière de la cabine de toilette pour une barre d'appui d'une longueur minimale de 24 po [610 mm], centrée sur la cabine de toilette.
